Revit 2027 API
FamilyType.AsDouble Method
Provides access to the double precision number of the given family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? AsDouble(
	FamilyParameter familyParameter
)
Public Function AsDouble (
	familyParameter As FamilyParameter
) As Double?
public:
Nullable<double> AsDouble(
	FamilyParameter^ familyParameter
)
member AsDouble :
        familyParameter : FamilyParameter -> Nullable<float>
Parameters
familyParameter FamilyParameter
Return Value
Nullable<Double>
The double value contained in the parameter. Returns null if the storage type of the input argument is not double type or this parameter has no value.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid,
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace